dokumentacja/edm/P1-DS-Dokumentacja_integracyjna_P1_EDM_20220915_W16/Załącznik nr 3 - Przykłady - wersja 1.16/iti18/Przykład wywołania wyszukiwania przy użyciu ITI-18.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
	<s:Header>
		<wsse:Security mustUnderstand="1">
			<wsse:BinarySecurityToken   
               EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" 
               ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" 
               wsu:Id="x509certificate">
			   ...
			</wsse:BinarySecurityToken>
			<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
			   ...
			</ds:Signature>
			<saml:Assertion xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion"
			                ID="_181835fb981efecaf71d80ecd5fc3c74" Version="2.0"
			                IssueInstant="2019-08-26T09:22:05Z">
			    <saml:Issuer>http://csioz.gov.pl/p1/aut</saml:Issuer>
			    <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
			        ...
			    </ds:Signature>
			    <saml:Subject>
			        <saml:NameID Format="urn:oasis:names:tc:SAML:2.0:attrname-format:unspecified">2.16.840.1.113883.3.4424.2.6#2017123</saml:NameID>
			        <saml:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:sender-vouches"/>
			    </saml:Subject>
			    <saml:Conditions NotBefore="2019-08-26T09:17:05Z" NotOnOrAfter="2019-08-26T11:17:05Z"/>
			    <saml:AuthnStatement AuthnInstant="2019-08-26T09:22:00Z">
			        <saml:AuthnContext>
			            <saml:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:PasswordProtectedTransport</saml:AuthnContextClassRef>
			        </saml:AuthnContext>
			    </saml:AuthnStatement>
			    <saml:AttributeStatement xmlns:xacmlprof="urn:oasis:names:tc:SAML:2.0:profiles:attribute:XACML"
			                             xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
			                             xmlns:xs="http://www.w3.org/2001/XMLSchema">
			        <saml:Attribute NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"
			                        Name="urn:oasis:names:tc:SAML:attribute:subject-id"
			                        xacmlprof:DataType="http://www.w3.org/2001/XMLSchema#anyURI">
			            <saml:AttributeValue xsi:type="xs:anyURI">2.16.840.1.113883.3.4424.1.6.2#3241138</saml:AttributeValue>
			        </saml:Attribute>
			        <saml:Attribute NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"
			                        Name="urn:oasis:names:tc:xspa:1.0:subject:organization-id"
			                        xacmlprof:DataType="http://www.w3.org/2001/XMLSchema#anyURI">
			            <saml:AttributeValue xsi:type="xs:anyURI">2.16.840.1.113883.3.4424.2.3.1#000000001779</saml:AttributeValue>
			        </saml:Attribute>
			        <saml:Attribute NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"
                                    Name="urn:oasis:names:tc:xspa:1.0:subject:child-organization"
                                    xacmlprof:DataType="http://www.w3.org/2001/XMLSchema#anyURI">
                        <saml:AttributeValue xsi:type="xs:anyURI">2.16.840.1.113883.3.4424.2.3.3#000000001779-039</saml:AttributeValue>
                    </saml:Attribute>
			        <saml:Attribute NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"
			                        Name="urn:oasis:names:tc:xacml:1.0:resource:resource-id"
			                        xacmlprof:DataType="http://www.w3.org/2001/XMLSchema#anyURI">
			            <saml:AttributeValue xsi:type="xs:anyURI">2.16.840.1.113883.3.4424.1.1.616#94071712351</saml:AttributeValue>
			        </saml:Attribute>
			        <saml:Attribute NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:unspecified"
			                        Name="urn:oasis:names:tc:xspa:1.0:subject:functional-role"
			                        xacmlprof:DataType="http://www.w3.org/2001/XMLSchema#string">
			            <saml:AttributeValue xsi:type="xs:string">medical doctor</saml:AttributeValue>
			        </saml:Attribute>
			        <saml:Attribute NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:unspecified"
			                        Name="urn:oasis:names:tc:xacml:1.0:action:action-id"
			                        xacmlprof:DataType="http://www.w3.org/2001/XMLSchema#string">
			            <saml:AttributeValue xsi:type="xs:string">READ</saml:AttributeValue>
			        </saml:Attribute>
			        <saml:Attribute NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:unspecified"
			                        Name="urn:oasis:names:tc:xacml:2.0:action:purpose"
			                        xacmlprof:DataType="http://www.w3.org/2001/XMLSchema#string">
			            <saml:AttributeValue xsi:type="xs:string">RECORDMGT</saml:AttributeValue>
			        </saml:Attribute>
			        <saml:Attribute NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"
			                        Name="urn:ihe:iti:xca:2010:homeCommunityId"
			                        xacmlprof:DataType="http://www.w3.org/2001/XMLSchema#anyURI">
			            <saml:AttributeValue xsi:type="xs:anyURI">2.16.840.1.113883.3.4424.15</saml:AttributeValue>
			        </saml:Attribute>
			    </saml:AttributeStatement>
			</saml:Assertion>
		</wsse:Security>	
	</s:Header>
	<s:Body>
		<query:AdhocQueryRequest xmlns:lcm="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0" xmlns:query="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0" xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:rs="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:xdsb="urn:ihe:iti:xds-b:2007" xmlns:xop="http://www.w3.org/2004/08/xop/include">
			<query:ResponseOption returnComposedObjects="true" returnType="ObjectRef"/>
			<rim:AdhocQuery home="urn:oid:1.3.6.1.4.1.21367.2011.2.6.47" id="urn:uuid:14d4debf-8f97-4251-9a74-a90016b0af0d">
				<rim:Slot name="$XDSDocumentEntryPatientId">
					<rim:ValueList>
						<rim:Value>'P123456789^^^&amp;2.16.840.1.113883.3.4424.2.7.2.17.1&amp;ISO'</rim:Value>
					</rim:ValueList>
				</rim:Slot>
				<rim:Slot name="$XDSDocumentEntryStatus">
					<rim:ValueList>
						<rim:Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Approved')</rim:Value>
					</rim:ValueList>
				</rim:Slot>
			</rim:AdhocQuery>
		</query:AdhocQueryRequest>
	</s:Body>
</s:Envelope>